Revit 2024 API
OBJExportOptions.IsValidForNormalTolerance Method
 Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static bool IsValidForNormalTolerance(
	double value
)
Visual Basic
Public Shared Function IsValidForNormalTolerance ( _
	value As Double _
) As Boolean
Visual C++
public:
static bool IsValidForNormalTolerance(
	double value
)
Parameters
value
Type: System.Double
 The value to be checked.
Return Value
 True if the value is valid for NormalTolerance, false otherwise.
See Also
OBJExportOptions Class
Autodesk.Revit.DB Namespace